app/Controllers/Announcement.php

    public function index()
    {
        $userId = session()->get('user_id');
        $userRole = session()->get('userRole');

        $announcementModel = new AnnouncementModel();
        $courseModel = new CourseModel();
        $enrollmentModel = new EnrollmentModel();
        $userModel = new UserModel();

        if ($userRole === 'student') {
            $enrolledCourses = $enrollmentModel->where('user_id', $userId)->findAll();
            $courseIds = array_column($enrolledCourses, 'course_id');

            $studentAnnouncements = [];
            if (!empty($courseIds)) {
                // Get student announcements for their enrolled courses
                $enrolledStudentAnnouncements = $announcementModel->whereIn('course_id', $courseIds)->where('role', 'student')->orderBy('created_at', 'DESC')->findAll();
                $generalStudentAnnouncements = $announcementModel->where('course_id', null)->where('role', 'student')->orderBy('created_at', 'DESC')->findAll();
                $studentAnnouncements = array_merge($enrolledStudentAnnouncements, $generalStudentAnnouncements);
            } else {
                $studentAnnouncements = $announcementModel->where('course_id', null)->where('role', 'student')->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '8'
SELECT *
FROM `announcements`
WHERE `course_id` IS NULL
AND `role` = 'student'
ORDER BY `created_at` DESC


            // Get author information
            if (isset($announcement['user_id']) && $announcement['user_id']) {
                $author = $userModel->find($announcement['user_id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'