app/Controllers/Auth.php

SELECT *
FROM `courses`
---
            $data['enrolledCourses'] = $enrolledCourses;

            // Get all courses
            $allCourses = $courseModel->findAll();