app/Controllers/Course.php

            $data['enrolledCourses'] = $enrolledCourses;

            // Get all courses
            $allCourses = $courseModel->findAll();
---
SELECT *
FROM `courses`

    public function search()
    {
        $courseModel = new CourseModel();
        $searchTerm = $this->request->getVar('search_term');

        if (!empty($searchTerm)) {
            $courseModel->like('title', $searchTerm);
            $courseModel->orLike('description', $searchTerm);
        }

        $courses = $courseModel->findAll();
---
SELECT *
FROM `courses`
WHERE `title` LIKE '% Web Development Fundamentals%' ESCAPE '!'
OR  `description` LIKE '% Web Development Fundamentals%' ESCAPE '!'