app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function index()
    {
        $userRole = session()->get('userRole');

        if ($userRole !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied. Admin only.');
        }

        $userModel = new UserModel();

        $currentUserId = session()->get('user_id');

        $nonAdminUsers = $userModel->where('role !=', 'admin')->findAll();